# -*- coding: utf-8 -*-
'''
Задание 5.1a

Всё, как в задании 5.1. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.1.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
IP = input('Type IP-adress:')
Address = IP.split('/')
IP = Address[0]
MASK = int(Address[1])
IP = IP.split('.')
#print(type(IP))
CIDR = {24:[255, 255, 255, 0], 30:[255, 255, 255, 252], 32:[255, 255, 255, 255]}


A = int(IP[0])
B = int(IP[1])
C = int(IP[2])
D = int(IP[3])
#print(type(A))
A1 = (CIDR[MASK])[0]
B1 = (CIDR[MASK])[1]
C1 = (CIDR[MASK])[2]
D1 = (CIDR[MASK])[3]
#print(type(A1))

"""
A2 = int(bin(A & A1),2)
B2 = int(bin(B & B1),2)
C2 = int(bin(C & C1),2)
D2 = int(bin(D & D1),2)
#print(A2)
"""

A2 = A & A1
B2 = B & B1
C2 = C & C1
D2 = D & D1

""" Example 1
OUPUT1 = '''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}

'''
OUPUT2 = '''
Mask:
/{MASK}
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
'''
print(OUPUT1.format(A,B,C,D))
print(OUPUT2.format(A1,B1,C1,D1,MASK = MASK))

#print(A1)
"""


OUPUT1 = ''' # Example 2
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}

Mask:
/{MASK}
{4:<8} {5:<8} {6:<8} {7:<8}
{4:08b} {5:08b} {6:08b} {7:08b}
'''
print(OUPUT1.format(A2,B2,C2,D2,A1,B1,C1,D1,MASK = MASK))
